README.md

# Table of Contents

1.  [Morgan&rsquo;s AmaZing engine!!! (or MAZzy engine)](#org958763e)
2.  [What is Mazengine?](#org014c1f5)
3.  [How is a Mazengine game implemented?](#org73313cf)
4.  [Where should I go next?](#org3de814c)



<a id="org958763e"></a>

# Morgan&rsquo;s AmaZing engine!!! (or MAZzy engine)

This is a little game engine I&rsquo;ve been working on for the past couple of months, and I figured it&rsquo;s beginning to deserve its own repository. This engine is designed first and foremost to be readable and mod-able with less nitty-gritty, low to the metal, coding. Essentially, it is supposed to use as little C++ code as possible, and as many YAML files as are necessary for development. Additionally, I will be providing thorough documentation and perhaps even some literate programming in some of the more code intensive sections of the project.


<a id="org014c1f5"></a>

# What is Mazengine?

Mazengine is a collection of code frameworks and outlines which is intended to be easy to add to without over-complicated code, without overly-deep nested code patterns, and without too much object-oriented abstractions. I&rsquo;m probably more opinionated and picky than the average programmer, so some other game engines really didn&rsquo;t work for me, so this is my shot at it.


<a id="org73313cf"></a>

# How is a Mazengine game implemented?

Mazengine comes with a certain set of classes defined that act as games, and all Mazengine games are *supposed* to be designed with certain rules in mind. In essence, a Mazengine game is implemented with hefty amounts of YAML, a couple user-defined functions, and an init file which wraps everything together. More on this later.


<a id="org3de814c"></a>

# Where should I go next?

Generate the Doxygen docs and start reading! The documentation is a little sparse as of now, but I&rsquo;m working on this alone so it&rsquo;s a bit of a task, but there should be enough for you to get a sense of what is going on.

